Repository: jecem-ben-slama/steg_front
Catalog: lib/Utils/l10n/app_*.arb
Languages: fr

# loginTitle
source: Login
fr: Connexion

source: Welcome Back!
fr: Bienvenue de retour !

source: Password
fr: Mot de passe

source: Login
fr: Se connecter

source: Forgot Password?
fr: Mot de passe oublié ?

source: Login Failed: {error}
fr: Échec de connexion : {error}

# unknownRole
source: Unknown user role. Logging out.
fr: Rôle d'utilisateur inconnu. Déconnexion.

# emailRequired
source: Email is required.
fr: L'e-mail est requis.

# passwordRequired
source: Password is required.
fr: Le mot de passe est requis.

# passwordTooShort
source: Password must be at least 6 characters long.
fr: Le mot de passe doit contenir au moins 8 caractères

source: Confirm Deletion
fr: Confirmer la suppression

# deleteConfirmationContent
source: Are you sure you want to delete this internship? This action cannot be undone.
fr: Êtes-vous sûr de vouloir supprimer ce stage ? Cette action est irréversible.

source: Cancel
fr: Annuler

source: Delete
fr: Supprimer

# searchHint
source: Search by student, subject, supervisor, status...
fr: Rechercher par étudiant, sujet, encadrant, statut...

# statusLabel
source: Status
fr: Statut

source: All
fr: Tout

source: Active Internships
fr: Stages Actifs

# totalEncadrants
source: Total Supervisors
fr: Total Encadrants

source: Pending Evaluations
fr: Évaluations en attente

# errorLoadingStatistics
source: Error loading statistics: {message}
fr: Erreur lors du chargement des statistiques : {message}

source: Retry Stats
fr: Réessayer les statistiques

source: Manage Student
fr: Gérer les étudiants

source: Manage Subject
fr: Gérer les sujets

source: Manage Supervisor
fr: Gérer les encadrants

source: Internships
fr: Stages

source: Add Internship
fr: Ajouter un stage

source: Student Name
fr: Nom de l'étudiant

source: Subject
fr: Sujet

source: Supervisor
fr: Encadrant

source: Start Date
fr: Date de début

source: End Date
fr: Date de fin

source: Status
fr: Statut

# internshipIdMissing
source: Internship ID is missing for deletion.
fr: L'ID du stage est manquant pour la suppression.

# noMatchingInternships
source: No matching internships found for current filters.
fr: Aucun stage correspondant aux filtres actuels.

source: No internships found.
fr: Aucun stage trouvé.

source: My Profile
fr: Mon Profil

source: Role
fr: Rôle

source: Username
fr: Nom d'utilisateur

source: Last Name
fr: Nom de famille

source: Please enter a username
fr: Veuillez saisir un nom d'utilisateur

source: Please enter a last name
fr: Veuillez saisir un nom de famille

source: Please enter an email
fr: Veuillez saisir un e-mail

source: Enter a valid email
fr: Veuillez saisir une adresse e-mail valide

# newPassword
source: New Password (leave blank to keep current)
fr: Nouveau mot de passe (laisser vide pour conserver l'actuel)

source: Update Profile
fr: Mettre à jour le profil

# errorLoadingInternships
source: Error loading internships: {message}
fr: Erreur de chargement des stages : {message}

source: Add New Internship
fr: Ajouter un nouveau stage

source: Internship Type
fr: Type de stage

# pleaseSelectInternshipType
source: Please select an internship type.
fr: Veuillez sélectionner un type de stage.

source: Please enter start date.
fr: Veuillez saisir la date de début.

source: Please enter end date.
fr: Veuillez saisir la date de fin.

source: Is Remunerated?
fr: Est rémunéré ?

source: Remuneration Amount
fr: Montant de la rémunération

source: Please enter remuneration amount.
fr: Veuillez saisir le montant de la rémunération.

source: Please enter a valid number.
fr: Veuillez saisir un numéro valide.

source: Student
fr: Étudiant

source: Please select a student.
fr: Veuillez sélectionner un étudiant.

# errorLoadingStudents
source: Error loading students: {message}
fr: Erreur de chargement des étudiants : {message}

source: Please select a supervisor.
fr: Veuillez sélectionner un encadrant.

# errorLoadingSupervisors
source: Error loading supervisors: {message}
fr: Erreur de chargement des encadrants : {message}

source: Clear
fr: Effacer

source: Close
fr: Fermer

# pleaseSelectAllFields
source: Please select Internship Type, Student, and Supervisor.
fr: Veuillez sélectionner le type de stage, l'étudiant et l'encadrant.

# endDateAfterStartDate
source: End Date cannot be before Start Date.
fr: La date de fin ne peut pas être antérieure à la date de début.

source: Edit Internship
fr: Modifier le stage

source: Subject Title
fr: Titre du sujet

# noSupervisorsAvailable
source: No supervisors available. Cannot assign.
fr: Aucun encadrant disponible. Impossible d'assigner.

source: Save
fr: Enregistrer

# noInternshipsForAttestation
source: No internships eligible for attestation yet.
fr: Aucun stage éligible pour une attestation pour le moment.

source: Period
fr: Période

source: Payslip
fr: Fiche de Paie

# payslipGenerated
source: Payslip PDF generated!
fr: Fiche de paie PDF générée !

# errorGeneratingPayslip
source: Error generating Payslip PDF: {error}
fr: Erreur lors de la génération de la fiche de paie PDF : {error}

source: Try Again
fr: Réessayer

source: Loading attestable internships...
fr: Chargement des stages attestables...

# attestationGenerated
source: Attestation PDF generated!
fr: Attestation PDF générée !

# errorGeneratingAttestation
source: Error generating Attestation PDF: {error}
fr: Erreur lors de la génération de l'attestation PDF : {error}

source: Manage Students
fr: Gérer les étudiants

# pleaseFillRequiredFields
source: Please fill in all required fields.
fr: Veuillez remplir tous les champs obligatoires.

# confirmDeleteStudent
source: Are you sure you want to delete this Student?
fr: Êtes-vous sûr de vouloir supprimer cet étudiant ?

source: Add New Student
fr: Ajouter un nouvel étudiant

source: Edit Student
fr: Modifier l'étudiant

source: Hide Form
fr: Masquer le formulaire

source: Show Form
fr: Afficher le formulaire

source: First Name
fr: Prénom

source: Last Name cannot be empty.
fr: Le nom de famille ne peut pas être vide.

source: Email cannot be empty.
fr: L'e-mail ne peut pas être vide.

source: Level of Study
fr: Niveau d'étude

# pleaseSelectLevelOfStudy
source: Please select a Level of Study.
fr: Veuillez sélectionner un niveau d'étude.

source: Faculty
fr: Faculté

# pleaseSelectFaculty
source: Please select a Faculty.
fr: Veuillez sélectionner une faculté.

# pleaseSelectCycle
source: Please select a Cycle.
fr: Veuillez sélectionner un cycle.

source: Specialty
fr: Spécialité

# pleaseSelectSpecialty
source: Please select a Specialty.
fr: Veuillez sélectionner une spécialité.

source: Add Student
fr: Ajouter l'étudiant

source: Update Student
fr: Mettre à jour l'étudiant

source: Existing Students
fr: Étudiants existants

source: Search Students
fr: Rechercher des étudiants

source: Search by name, email, CIN...
fr: Rechercher par nom, e-mail, CIN...

# noStudentsFound
source: No students found. Add one using the form above!
fr: Aucun étudiant trouvé. Ajoutez-en un à l'aide du formulaire ci-dessus !

# noStudentsFoundMatching
source: No students found matching "{query}".
fr: Aucun étudiant trouvé correspondant à "{query}".

source: Edit
fr: Modifier

source: No students to display.
fr: Aucun étudiant à afficher.

source: Attestation Details
fr: Détails de l'attestation

source: Select an option
fr: Sélectionnez une option

source: Manage Subjects
fr: Gérer les sujets

# confirmDeleteSubject
source: Are you sure you want to delete this Subject?
fr: Êtes-vous sûr de vouloir supprimer ce sujet ?

source: Add New Subject
fr: Ajouter un nouveau sujet

source: Subject Name
fr: Nom du sujet

source: Subject Name cannot be empty.
fr: Le nom du sujet ne peut pas être vide.

source: Description (Optional)
fr: Description (Facultatif)

source: Add Subject
fr: Ajouter un sujet

source: Update Subject
fr: Mettre à jour le sujet

source: Existing Subjects
fr: Sujets existants

# searchSubjects
source: Search subjects by name or description...
fr: Rechercher des sujets par nom ou description...

# noSubjectsFoundMatching
source: No subjects found matching "{query}".
fr: Aucun sujet trouvé correspondant à "{query}".

# noSubjectsFoundAddOne
source: No subjects found. Add one using the form above!
fr: Aucun sujet trouvé. Ajoutez-en un à l'aide du formulaire ci-dessus !

# startManagingSubjects
source: Start managing Subjects by adding one above.
fr: Commencez à gérer les sujets en en ajoutant un ci-dessus.

source: Manage Supervisors
fr: Gérer les encadrants

# confirmDeleteUser
source: Are you sure you want to delete this user?
fr: Êtes-vous sûr de vouloir supprimer cet utilisateur ?

source: Add New User
fr: Ajouter un nouvel utilisateur

source: Edit User
fr: Modifier l'utilisateur

source: First Name cannot be empty.
fr: Le prénom ne peut pas être vide.

# emailInvalid
source: Please enter a valid email address.
fr: Veuillez saisir une adresse e-mail valide.

# passwordRequiredForNewUsers
source: Password is required for new users.
fr: Le mot de passe est requis pour les nouveaux utilisateurs.

source: Add User
fr: Ajouter un utilisateur

source: Update User
fr: Mettre à jour l'utilisateur

source: Existing Supervisors
fr: Encadrants existants

# searchSupervisors
source: Search supervisors by name or email...
fr: Rechercher des encadrants par nom ou e-mail...

# noSupervisorsFoundMatching
source: No supervisors found matching "{query}".
fr: Aucun encadrant trouvé correspondant à "{query}".

# noSupervisorsFoundAddOne
source: No supervisors found. Add one using the form above!
fr: Aucun encadrant trouvé. Ajoutez-en un à l'aide du formulaire ci-dessus !

# startManagingUsers
source: Start managing users by adding one above.
fr: Commencez à gérer les utilisateurs en en ajoutant un ci-dessus.

source: Internship Distributions
fr: Distributions des stages

source: Internship Status Distribution
fr: Distribution des statuts de stage

source: Internship Type Distribution
fr: Distribution des types de stage

source: Internship Duration Distribution
fr: Distribution de la durée des stages

source: Encadrant Workload Distribution
fr: Distribution de la charge de travail des encadrants

source: Faculty Internship Summary
fr: Résumé des stages par faculté

source: Total Students
fr: Total des étudiants

source: Total Internships
fr: Total des stages

source: Validated Internships
fr: Stages validés

source: Success Rate
fr: Taux de réussite

# noFacultyInternshipSummary
source: No faculty internship summary data available.
fr: Aucune donnée de résumé des stages par faculté disponible.

source: Subject Distribution
fr: Distribution des sujets

source: Loading Internship Statistics...
fr: Chargement des statistiques de stage...

source: No pending internships to review.
fr: Aucun stage en attente à examiner.

source: No Subject Title
fr: Aucun titre de sujet

source: From
fr: Du

source: To
fr: À

source: Remuneration
fr: Rémunération

source: Accept
fr: Accepter

source: Reject
fr: Rejeter

source: Chef Panel
fr: Panneau du Chef

# evaluationsPendingApproval
source: Evaluations Pending Your Approval
fr: Évaluations en attente de votre approbation

# noEvaluationsPending
source: No evaluations currently require your validation.
fr: Aucune évaluation ne nécessite actuellement votre validation.

source: Internship Subject
fr: Sujet du stage

source: Internship Status
fr: Statut du stage

# encadrantEvaluation
source: Encadrant's Evaluation
fr: Évaluation de l'encadrant

source: Evaluation Date
fr: Date d'évaluation

source: Comments
fr: Commentaires

source: No comments provided
fr: Aucun commentaire fourni

source: Validate
fr: Valider

source: Reject Evaluation
fr: Rejeter l'évaluation

# reasonForRejection
source: Reason for Rejection (Optional)
fr: Raison du rejet (Facultatif)

# failedToLoadEvaluations
source: Failed to load evaluations: {message}
fr: Échec du chargement des évaluations : {message}

source: All Staff
fr: Tout le personnel

# cannotDeleteUserWithoutId
source: Cannot delete user without an ID.
fr: Impossible de supprimer l'utilisateur sans ID.

# noUsersFoundFor
source: No users found for "{query}" in "{role}".
fr: Aucun utilisateur trouvé pour "{query}" dans "{role}".

# noUsersFoundForRole
source: No {role} users found.
fr: Aucun utilisateur {role} trouvé.

# noUsersFoundAddOne
source: No users found. Add one using the form above!
fr: Aucun utilisateur trouvé. Ajoutez-en un à l'aide du formulaire ci-dessus !

source: Delete User
fr: Supprimer l'utilisateur

source: Add Staff User
fr: Ajouter un utilisateur du personnel

source: Update Staff User
fr: Mettre à jour l'utilisateur du personnel

# passwordRequiredForNewUser
source: Password is required for new user
fr: Le mot de passe est requis pour le nouvel utilisateur

source: Please select a role
fr: Veuillez sélectionner un rôle

source: Add New Note
fr: Ajouter une nouvelle note

source: Note Content
fr: Contenu de la note

source: Enter your note here...
fr: Saisissez votre note ici...

source: Please enter note content.
fr: Veuillez saisir le contenu de la note.

source: Add Note
fr: Ajouter une note

source: Assign Subject
fr: Assigner un sujet

source: Loading subjects...
fr: Chargement des sujets...

source: No subjects available.
fr: Aucun sujet disponible.

source: Select Subject
fr: Sélectionner un sujet

# errorLoadingSubjects
source: Error loading subjects: {message}
fr: Erreur de chargement des sujets : {message}

# selectSubjectToAssign
source: Select a subject to assign.
fr: Sélectionnez un sujet à assigner.

# noInternshipsAssigned
source: No internships assigned yet.
fr: Aucun stage assigné pour le moment.

source: Not Assigned
fr: Non assigné

source: Assigning subject...
fr: Assignation du sujet...

source: Please fetch internships.
fr: Veuillez récupérer les stages.

# myAssignedInternshipsAndNotes
source: My Assigned Internships & Notes
fr: Mes stages assignés et notes

source: Internships Assigned to You
fr: Stages qui vous sont assignés

# noInternshipsAssignedToYou
source: No internships currently assigned to you.
fr: Aucun stage ne vous est actuellement assigné.

# noNotesAdded
source: No notes added for this internship yet.
fr: Aucune note ajoutée pour ce stage pour le moment.

source: by
fr: par

source: on
fr: le

# errorLoadingNotes
source: Error loading notes: {message}
fr: Erreur de chargement des notes : {message}

# evaluateInternship
source: Evaluate Internship ID: {id}
fr: Évaluer le stage ID : {id}

source: Comments (Optional)
fr: Commentaires (Facultatif)

source: Save Evaluation
fr: Enregistrer l'évaluation

source: Confirm Unvalidation
fr: Confirmer l'invalidation

# unvalidationContent
source: Are you sure you want to mark this internship as "Refused"? This will set its status to "Refusé" and clear your evaluation.
fr: Êtes-vous sûr de vouloir marquer ce stage comme "Refusé" ? Cela définira son statut à "Refusé" et effacera votre évaluation.

source: Confirm
fr: Confirmer

# internshipsAwaitingFinalEvaluation
source: Internships Awaiting Your Final Evaluation
fr: Stages en attente de votre évaluation finale

# noFinishedInternships
source: No finished internships currently assigned to you.
fr: Aucun stage terminé ne vous est actuellement assigné.

source: Current Status
fr: Statut actuel

source: Your Evaluation:
fr: Votre évaluation :

source: No comments
fr: Aucun commentaire

# noEvaluationYet
source: No evaluation from you yet.
fr: Aucune évaluation de votre part pour le moment.

source: Edit Evaluation
fr: Modifier l'évaluation

source: Refuse
fr: Refuser

# failedToLoadInternships
source: Failed to load internships: {message}
fr: Échec du chargement des stages : {message}

source: Attestation of Internship
fr: Attestation de stage

source: Trainee
fr: Stagiaire

source: Trainee Email
fr: E-mail du stagiaire

source: Unspecified
fr: Non spécifié

source: Evaluation
fr: Évaluation

source: Scan to Verify Attestation:
fr: Scanner pour vérifier l'attestation :

source: Attestation ID
fr: ID de l'attestation

source: Create Attestation PDF
fr: Créer l'attestation PDF

# payslipTitle
source: Payslip
fr: Fiche de paie

# companyName
source: [Your Company Name]
fr: [Nom de votre entreprise]

# companyAddress
source: [Your Company Address]
fr: [Adresse de votre entreprise]

# companyCityPostal
source: [City, Postal Code]
fr: [Ville, Code Postal]

source: Employee (Trainee)
fr: Employé (Stagiaire)

source: Name
fr: Nom

source: Internship Details
fr: Détails du stage

source: Remuneration Details
fr: Détails de la rémunération

source: Gross Amount
fr: Montant brut

# socialContributions
source: Social Contributions (Est.)
fr: Cotisations Sociales (Est.)

source: NET PAYABLE AMOUNT
fr: MONTANT NET À PAYER

# madeInCity
source: Made in [Your City], on {date}
fr: Fait à [Votre Ville], le {date}

# employerSignature
source: Employer's Signature
fr: Signature de l'Employeur

# directorName
source: [Director/Manager Name]
fr: [Nom du Directeur/Responsable]

source: [Title/Function]
fr: [Titre/Fonction]

source: Warning!
fr: Attention !

source: Hey There!
fr: Salut !
